# Install interesting packages.
#
# This assumes that the current user is the user used to install
# packages and has the proper administrator privileges.

tap "homebrew/bundle"
tap "homebrew/services"

brew "arm-none-eabi-binutils"
brew "arm-none-eabi-gcc"
brew "arm-none-eabi-gdb"
# brew "arp-scan"
# brew "arp-sk"
# brew "arpoison"
brew "aspell"
brew "avrdude"
brew "azure-cli"
brew "bash-completion"
brew "bear"
brew "boost"
brew "boost-bcp"
brew "boost-build"
brew "cflow"
brew "cmake"
brew "cmark-gfm"
brew "cppcheck"
brew "curl"
# brew "dfu-util"
brew "dict"
brew "dita-ot"
brew "docbook"
brew "docbook-xsl"
brew "docker-completion"
brew "dos2unix"
brew "doxygen"
brew "emacs"
# brew "emscripten"
brew "enscript"
brew "gcc"
# brew "gcc@7"
# brew "gcc@8"
# brew "gcc@9"
# brew "gcc@10"
brew "gcc@11"
brew "gcc@12"
brew "gcc@13"
brew "gcc@14"
# brew "gdb"
brew "gem-completion"
brew "gh"
brew "git"
brew "git-lfs"
# brew "gitfs"
brew "glew"
brew "glfw"
brew "glm"
brew "global"
brew "glslang"
brew "gnu-typist"
brew "gnuplot"
brew "go"
brew "gpg"
brew "graphviz"
brew "guile"
brew "hadolint"
brew "highlight"
brew "htop"
# brew "httping"
# brew "httpry"
brew "iperf"
# brew "ipv6calc"
brew "java"
brew "jq"
brew "julia"
brew "launchctl-completion"
# brew "legit"
brew "llvm"
# brew "llvm@7"
# brew "llvm@8"
# brew "llvm@9"
# brew "llvm@10"
# brew "llvm@11"
# brew "llvm@12"
# brew "llvm@13"
brew "llvm@14"
brew "llvm@15"
brew "llvm@16"
brew "llvm@17"
brew "llvm@18"
brew "llvm@19"
brew "lua"
brew "luarocks"
brew "maven"
brew "maven-completion"
brew "mit-scheme"
# brew "mscgen"
brew "netcat"
# brew "netperf"
brew "nmap"
brew "node"
brew "nuttcp"
brew "open-completion"
brew "openjdk"
# brew "openssh"
brew "p0f"
brew "p7zip"
brew "pandoc"
# brew "parallel"
brew "pinentry"
brew "pip-completion"
brew "pkg-config"
brew "python3"
brew "qemu"
brew "rsync"
brew "ruby"
brew "ruby-completion"
brew "rust"
brew "rustc-completion"
brew "shellcheck"
brew "socat"
brew "sqlite"
# brew "srecord"
brew "ssh-copy-id"
brew "standardese"
brew "stdman"
brew "stow"
brew "swig"
brew "tcpdump"
# brew "tcpflow"
# brew "tcping"
# brew "tcpreplay"
# brew "tcptrace"
# brew "tcptraceroute"
# brew "tcptrack"
brew "tig"
brew "tmux"
brew "v8"
# brew "vegeta"
# brew "vim"
brew "wget"
# brew "xctool"
brew "xmlstarlet"
brew "xmlto"
brew "zsh-completions"

# brew "osx-cross/arm/arm-gcc-bin@8"
# brew "osx-cross/arm/arm-gcc-bin@9"
# brew "osx-cross/arm/arm-gcc-bin@10"
brew "osx-cross/arm/arm-gcc-bin@11"
brew "osx-cross/arm/arm-gcc-bin@12"
brew "osx-cross/arm/arm-gcc-bin@13"
brew "osx-cross/arm/arm-gcc-bin@14"
# brew "osx-cross/avr/avr-gcc@8"
# brew "osx-cross/avr/avr-gcc@9"
# brew "osx-cross/avr/avr-gcc@10"
brew "osx-cross/avr/avr-gcc@11"
brew "osx-cross/avr/avr-gcc@12"
brew "osx-cross/avr/avr-gcc@13"
brew "osx-cross/avr/avr-gcc@14"
brew "osx-cross/avr/avr-gdb"
# brew "osx-cross/avr/simavr"
