# Install interesting packages.
#
# This assumes that the current user is the user used to install
# packages and has the proper administrator privileges.

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

#brew "arp-scan"
#brew "arp-sk"
#brew "arpoison"
brew "aspell"
brew "avrdude"
brew "bash-completion"
brew "bear"
brew "boost"
brew "boost-bcp"
brew "boost-build"
brew "cflow"
brew "cmake"
brew "cmark-gfm"
brew "cppcheck"
brew "curl"
#brew "dfu-util"
brew "dict"
brew "dita-ot"
brew "docbook"
brew "docbook-xsl"
brew "docker-completion"
brew "dos2unix"
brew "doxygen"
brew "emacs"
#brew "emscripten"
brew "enscript"
brew "gcc"
brew "gcc@6"
brew "gcc@7"
brew "gcc@8"
brew "gcc@9"
brew "gcc@10"
brew "gdb"
brew "gem-completion"
brew "git"
brew "git-lfs"
brew "git-test"
#brew "gitfs"
brew "glew"
brew "glfw"
brew "glm"
brew "global"
brew "glslang"
brew "gnu-typist"
brew "gnuplot"
brew "go"
brew "gpg"
brew "graphviz"
brew "guile"
brew "hadolint"
brew "highlight"
brew "htop-osx"
#brew "httping"
#brew "httpry"
brew "hub"
brew "iperf"
#brew "ipv6calc"
brew "java"
brew "jq"
brew "julia"
brew "launchctl-completion"
#brew "legit"
brew "llvm"
#brew "llvm@7"
brew "llvm@8"
brew "llvm@9"
#brew "llvm@10"
brew "llvm@11"
brew "llvm@12"
brew "lua"
brew "luarocks"
brew "maven"
brew "maven-completion"
#brew "mscgen"
brew "netcat"
brew "netperf"
brew "nmap"
brew "node"
brew "nuttcp"
brew "open-completion"
brew "openjdk"
brew "openssh"
brew "p0f"
brew "p7zip"
brew "pandoc"
#brew "parallel"
brew "pinentry"
brew "pip-completion"
brew "pkg-config"
brew "python3"
brew "qemu"
#brew "rsync"
brew "ruby"
brew "ruby-completion"
brew "rust"
brew "rustc-completion"
brew "shellcheck"
brew "socat"
brew "sqlite"
#brew "srecord"
brew "ssh-copy-id"
brew "standardese"
brew "stdman"
brew "stow"
brew "swig"
brew "tcpdump"
#brew "tcpflow"
#brew "tcping"
#brew "tcpreplay"
#brew "tcptrace"
#brew "tcptraceroute"
#brew "tcptrack"
brew "terraform"
brew "tig"
brew "tmux"
brew "v8"
brew "vault"
#brew "vegeta"
#brew "vim"
brew "wget"
#brew "xctool"
brew "xmlformat"
brew "xmlstarlet"
brew "xmlto"
brew "zsh-completions"

brew "osx-cross/arm/arm-gcc-bin@8"
brew "osx-cross/arm/arm-gcc-bin@9"
brew "osx-cross/arm/arm-gcc-bin@10"
brew "osx-cross/avr/avr-gcc@5"
brew "osx-cross/avr/avr-gcc@8"
brew "osx-cross/avr/avr-gcc@9"
brew "osx-cross/avr/avr-gcc@10"
brew "osx-cross/avr/avr-gcc@11"
