# Install interesting packages.
#
# This assumes that the current user is the user used to install
# packages and has the proper administrator privileges.

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "chef/chef"
tap "drone/drone"
tap "riscv/riscv"

# install interpreters prior to other packages
cask "java"
# @todo use system python
#brew "python"
brew "python3"
# @todo use system ruby
#brew "ruby"

# install version control systems
brew "bazaar"
brew "git"
brew "subversion"

# install fuse
cask "osxfuse"
#brew "gitfs"
brew "sshfs"

brew "arp-scan"
brew "arp-sk"
brew "arpoison"
brew "aspell"
#brew "avrdude"
#brew "avr-binutils"
#brew "avr-gcc"
brew "bash-completion"
brew "bear"
brew "boost"
brew "boost-bcp"
brew "boost-build"
#brew "casperjs"
brew "cflow"
brew "clblas"
brew "clfft"
brew "clinfo"
brew "cmake"
brew "cmark-gfm"
brew "cppcheck"
brew "curl"
brew "dfu-util"
brew "dita-ot"
brew "dns2tcp"
brew "dnstop"
brew "docbook"
brew "docbook-xsl"
brew "dos2unix"
brew "doxygen"
#brew "emscripten"
brew "enscript"
#brew "ext2fuse"
brew "fortune"
#brew "gcc"
brew "gcc@6"
brew "gcc@7"
brew "gcc@8"
brew "gcc@9"
brew "gdb"
brew "gem-completion"
brew "git-flow"
brew "git-hooks"
brew "git-lfs"
brew "git-test"
brew "glew"
brew "glfw3"
brew "glib"
brew "glm"
brew "global"
brew "glslang"
brew "gnu-typist"
brew "gnuplot"
brew "go"
brew "gpg"
brew "graphviz"
brew "guile"
brew "hadolint"
brew "hdf5"
brew "highlight"
brew "htop-osx"
brew "httping"
brew "httpry"
brew "hub"
brew "iperf"
brew "ipv6calc"
brew "jam"
brew "jansson"
brew "jasper"
brew "jpeg"
brew "jq"
brew "jrnl"
#brew "jsl"
brew "jsmin"
brew "json-c"
brew "jsonpp"
brew "kubernetes-cli"
brew "launchctl-completion"
brew "legit"
brew "llvm", args: ["HEAD"]
brew "llvm@4"
brew "llvm@5"
brew "llvm@6"
brew "llvm@7"
brew "lrzsz"
brew "lua"
brew "uncrustify"
brew "luarocks"
brew "markdown"
brew "maven"
brew "maven-completion"
#brew "mscgen"
brew "netcat"
brew "netperf"
brew "nmap"
brew "node"
#brew "ntfs-3g"
brew "nuttcp"
brew "open-completion"
brew "openocd"
brew "openssh"
#brew "osxfuse"
brew "p0f"
brew "p7zip"
brew "pandoc"
brew "parallel"
#brew "phantomjs"
brew "pinentry"
brew "pip-completion"
brew "pkg-config"
brew "protobuf"
brew "qemu"
#brew "rsync"
brew "ruby-completion"
brew "rust"
brew "shellcheck"
brew "sloccount"
brew "socat"
brew "sqlite"
brew "srecord"
brew "ssh-copy-id"
brew "stdman"
brew "stow"
brew "stress"
brew "swig"
brew "tcpdump"
brew "tcpflow"
brew "tcping"
#brew "tcpreplay"
brew "tcptrace"
brew "tcptraceroute"
#brew "tcptrack"
brew "termshare"
brew "terraform"
brew "tig"
brew "tmux"
brew "tree"
brew "v8"
brew "vault"
#brew "vegeta"
#brew "vim"
brew "webp"
brew "wget"
#brew "wireshark"
#brew "xctool"
brew "xmlformat"
brew "xmlstarlet"
brew "xmlto"

cask "1password"
cask "atom"
cask "basictex"
cask "docker"
cask "emacs"
cask "github"
cask "google-chrome"
cask "google-drive-file-stream"
#cask "homebrew/cask-drivers/nvidia-cuda"
cask "intellij-idea-ce"
cask "kindle"
cask "perforce"
cask "processing"
cask "slack"
cask "sourcetree"
cask "subgit"
cask "tex-live-utility"
cask "thunderbird"
cask "visual-studio-code"
cask "xquartz"
cask "chef/chef/chefdk"
